ПерваяЗадачаЧасть1/src/Documents/РасходТоваров/РасходТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходТоваров</name>
  <registerRecords>AccumulationRegister.ОстаткиНоменклатуры</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склад</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ПерваяЗадачаЧасть1/src/Documents/РасходТоваров/Forms/ФормаДокументаРасходТоваров/Module.bsl
&НаКлиенте
перем ПредНоменклатура;


&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент) // Изменение "Количество"
	
	ТекущаяСтрокаТовары = Элементы.Товары.ТекущиеДанные;
	КлиентРаботаСДокументами.РассчитатьСумму(ТекущаяСтрокаТовары); 
КонецПроцедуры


&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)  // Изменение "Цена"
	
	ТекущаяСтрокаТовары = Элементы.Товары.ТекущиеДанные;
	КлиентРаботаСДокументами.РассчитатьСумму(ТекущаяСтрокаТовары); 
КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)  // Изменение "Номенклатура"
	
	ТекущаяСтрокаТовары = Элементы.Товары.ТекущиеДанные;
	
	ТекущаяСтрокаТовары.Цена = 
		СерверРаботаСДокументами.ПолучитьРозничнуюЦену(ТекущаяСтрокаТовары.Номенклатура, 
		                                               Объект.Дата);
		                                               
    Если ПредНоменклатура <> Неопределено И 
         ПредНоменклатура <> ТекущаяСтрокаТовары.Номенклатура Тогда
         	
    	КлиентРаботаСДокументами.РассчитатьСумму(ТекущаяСтрокаТовары); 
    КонецЕсли;
    
    ПредНоменклатура = ТекущаяСтрокаТовары.Номенклатура; 	   
КонецПроцедуры
